homepage.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-01-13 wo 10:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>CODI-2 - Development Environment</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Paul Massey" />

<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>




</head>
<body>
<div id="content">
<h1 class="title">CODI-2 - Development Environment</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline2">2. Development Security</a></li>
<li><a href="#orgheadline3">3. Installing UV on the VM</a></li>
<li><a href="#orgheadline4">4. Installing UV offline</a></li>
<li><a href="#orgheadline5">5. Using MS Sql Server</a></li>
<li><a href="#orgheadline6">6. Environment Details</a></li>
<li><a href="#orgheadline7">7. Account Details</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The following tools are included in this development environment. It
has the following main entry point - <b><a href="http://localhost:8080/unifiedviews">Unified Views 2.3.0</a>~</b>. Other
tools which maybe accessible are:
</p>

<dl class="org-dl">
<dt><b><a href="http://localhost:8080/manager/html">Tomcat7 Management Page</a></b></dt><dd></dd>


<dt><b>MySQL</b></dt><dd></dd>
</dl>

<p>
<b>Note:</b> 
</p>
<ul class="org-ul">
<li>This environment does not contain virtuoso.</li>
<li>Plugins available are taken from docker-unified-views dpus.zip</li>
<li>Virtualbox Guest additions do not always work as expected.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Development Security</h2>
<div class="outline-text-2" id="text-2">
<p>
The environment is intended as a disposable development evironment,
all development work should be placed in a source code repository:
</p>

<ul class="org-ul">
<li>Files in /vagrant are shared with the host system, so to backup
pipelines, etc. the files need to be moved there (or preferable
saved directly from this machine using git, svn, etc.).</li>
</ul>

<p>
Vagrant VM's are intended as development environments (i.e. to be used
behind a firewall, etc.), they are <b><i>not</i></b> intended to be directly
connected to the internet, without changes to all the standard user
accounts, public passwords, etc.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Installing UV on the VM</h2>
<div class="outline-text-2" id="text-3">
<p>
This vagrant box is intended to mimic the approach which will be used
to installation on a clean system (such as one created by the <b>vagrant
up</b> command). There is no backing up of the system (none should be
needed initially). The commands to run should be:
</p>

<blockquote>
<p>
cd <i>vagrant
sudo ./install_uv_components.sh /email-account</i> <i>email-password</i>
</p>
</blockquote>

<p>
This will take a while, but should result in the system being updated
with UnifiedViews installed and running (<b>Note</b> if some of the sites
are unavailable for downloading, then the downloading and installation
will fail).
</p>

<p>
The <i>email-account</i> and <i>email-password</i> arguments will be used to
replace the default settings for sending emails during the pipeline
execution. If these are empty then nothing will be used (it will still
be necessary to update the default accounts in the interface. e.g. the
admin account email address).
</p>

<p>
The installation script will maintain a copy of the downloaded files
in the /vagrant/downloads directory with a view to reducting the cost
in the event of a rebuild of the systsem (downloading can be switched
off using a variable at the top of the script).
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Installing UV offline</h2>
<div class="outline-text-2" id="text-4">
<p>
Using the install script to setup for building and installing the
software offline is a multi-stage process (starting once the vagrant
machine has been booted/created).
</p>

<p>
1./ Set the DOWNLOAD_ALLOWED variable to "yes" (when connected to the
    internet). Once logged in, in a terminal:
</p>

<blockquote>
<p>
sudo DOWNLOAD_ALLOWED=yes ./install_uv_components.sh <i>email-account</i> <i>email-password</i>
</p>
</blockquote>

<p>
2./ Build the system at least once (so that the downloads are cached
    in the /vagrant directory).
</p>

<p>
3./ Copy the vagrant directory onto the remote system.
</p>

<p>
4./ Rerun the installation script with the DOWNLOAD_ALLOWED variable
    set to "no".
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Using MS Sql Server</h2>
<div class="outline-text-2" id="text-5">
<p>
For testing purposes the assumption here is that <a href="https://github.com/fgrehm/vagrant-mssql-express.git">Vagrant Test Machine</a>
is up and running and that a database 'unifiedviews' has been
created. The UV config settings assume that this machine is available
and on the localhost. Once the machine is up and running, the
following which make sure the appropriate configuration files are
used (DB_CONNECTION=mssql which indicate SQL Server is needed). 
</p>

<blockquote>
<p>
sudo DOWNLOAD_ALLOWED=yes DB_CONNECTION=mssql ./install_uv_components.sh
</p>
</blockquote>

<p>
Notes:
</p>
<ul class="org-ul">
<li>The MS SQL Server test machine should only be used for testing
(otherwise you'll need to activate it, etc.).</li>
<li>The sqljdbc41.jar will need to be available.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> Environment Details</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Component</b></th>
<th scope="col" class="org-right"><b>Version</b></th>
<th scope="col" class="org-left"><b>Pointer</b></th>
<th scope="col" class="org-left"><b>Notes</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">CentOS</td>
<td class="org-right">6.5</td>
<td class="org-left"><a href="http://google.com/">http://google.com/</a></td>
<td class="org-left">Kernel 2.6.32<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>, 64 bit</td>
</tr>

<tr>
<td class="org-left">UnifiedViews</td>
<td class="org-right">2.1.3</td>
<td class="org-left"><a href="http://unifiedviews.eu/">http://unifiedviews.eu/</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MySQL</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Firefox</td>
<td class="org-right">38.4.0</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Java</td>
<td class="org-right">1.7</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Tomcat</td>
<td class="org-right">7.0.65</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Maven</td>
<td class="org-right">3.3.9</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">common editors</td>
<td class="org-right">-</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">emacs, vim, nano</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">7</span> Account Details</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="http://localhost:8080/unifiedviews">Unified Views Account Details</a>::

<ul class="org-ul">
<li>Login account  : <i>admin</i></li>

<li>Login password : <i>test</i></li>
</ul></li>

<li>Mysql :

<ul class="org-ul">
<li>Login account  : <i>root</i></li>
<li>LOgin password : <i>root</i></li>
</ul></li>

<li><a href="http://localhost:8080/manager/html">Tomcat7 Manager</a> :

<ul class="org-ul">
<li>Login account  : <i>tomcat</i></li>
<li>LOgin password : <i>tomcat</i></li>
</ul></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Hence using docker is not possible.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Paul Massey</p>
<p class="date">Created: 2016-01-13 wo 10:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
